{"format": "graph-model", "generatedBy": "2.8.0", "convertedBy": "TensorFlow.js Converter v3.14.0", "signature": {"inputs": {"my_model_input": {"name": "my_model_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}}, "outputs": {"softmax": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/my_probability_model/my_model/flatten/Const", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "784"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "my_model_input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/flatten/Reshape", "op": "Reshape", "input": ["my_model_input", "StatefulPartitionedCall/my_probability_model/my_model/flatten/Const"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/my_probability_model/my_model/flatten/Reshape", "StatefulPartitionedCall/my_probability_model/my_model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/my_probability_model/my_model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"epsilon": {"f": 0.0}, "transpose_a": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/my_probability_model/my_model/dense/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/my_probability_model/my_model/dense/Sigmoid", "StatefulPartitionedCall/my_probability_model/my_model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/my_probability_model/my_model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/my_probability_model/softmax/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/my_probability_model/my_model/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/my_probability_model/softmax/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 987}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/my_probability_model/my_model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense/MatMul/ReadVariableOp", "shape": [784, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense_1/MatMul/ReadVariableOp", "shape": [128, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/my_probability_model/my_model/dense_1/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}